$(document).ready(function(){
	
	playerWare = [
		/*[["玩家名称","steamID"],
		  ["物品1","ID:","图片:","品质:","数量:1","总分类:","子分类:","mod:","物品说明"],
		  ["物品2","ID:","图片:","品质:","数量:2","总分类:","子分类:","mod:","物品说明"],
		  ["物品3","ID:","图片:","品质:","数量:3","总分类:","子分类:","mod:","物品说明"],
		  ["物品4","ID:","图片:","品质:","数量:4","总分类:","子分类:","mod:","物品说明"],
		  ["物品5","ID:","图片:","品质:","数量:5","总分类:","子分类:","mod:","物品说明"]
		],*/
		/* 玩家名称: 	仓库物品拥有者的游戏名称。
						这个会根据steamID从player.js或后端匹配玩家名称，无需手动设置。*/
		/* steamID: 	仓库物品拥有者的steamID，是有效检验身份的唯一凭证。
						可以手动设置为玩家创建一个仓库并修改物品内容。*/
		//--------------------------------------------------------------------------------
		/* 物品1~6: 	物品的名称，仅作用于在网页仓库显示
						如果设置成auto,表示自动从商品数组或后端获取汉化名称
		  				如果内容留空，则表示将ID作为名称 */
		/* ID: 			物品的ID，必填内容，如果不填将无法匹配到物品 */
		/* 图片: 		填写图片的相对路径,后面要写完整的图片格式（如:images/empty.png）
						如果设置成auto，表示自动从商品数组或后端获取 
						如果内容留空，则表示使用网页自带的默认图片（暂无图片） */
		/* 品质: 		如果设置成auto,表示自动从商品数组获取品质
		  				如果内容留空，则表示不设置品质或者在游戏中随机生成品质 */
		/* 数量: 		表示该商品拥有的数量 */
		/* 总分类: 		表示该商品所属的总分类，共有3个值:（物块模型、物品资源、特殊物品） 
						如果设置成auto,表示自动从商品数组或后端获取分类*/
		/* 子分类: 		表示该商品所属的子分类，如在物块模型中，子分类可能为“家具装饰” 
						如果设置成auto,表示自动从商品数组或后端获取分类 */
		/* mod: 		告诉玩家该商品是否属于mod
						如果设置成true,表示该商品是mod
						如果内容留空,表示该商品不是mod
						如果设置成auto,表示自动从商品数组或后端获取是否为mod */
		/* 物品说明: 	物品的说明简介,留空则表示不设置说明
						如果设置成auto,表示自动从商品数组或后端获取说明 */
		//head
		[["彩色の小木屋","76561199000000001"],
		
			[["积分兑换券","ID:积分","图片:auto"],
			["品质:auto","数量:1000"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["钻石兑换券","ID:钻石","图片:auto"],
			["品质:auto","数量:100"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["每日福利礼包","ID:每日福利礼包","图片:auto"],
			["品质:auto","数量:10"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["auto","ID:随机礼包","图片:auto"],
			["品质:auto","数量:8"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["auto","ID:新手礼包","图片:auto"],
			["品质:auto","数量:5"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["auto","ID:casinoCoin","图片:auto"],
			["品质:auto","数量:5000"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["南瓜灯","ID:decoPumpkinJackOLantern","图片:auto"],
			["品质:auto","数量:10"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["圣诞帽","ID:armorSantaHat","图片:auto"],
			["品质:auto","数量:5"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["Cxx的尿不湿","ID:Cxx的尿不湿","图片:auto"],
			["品质:auto","数量:520"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["Cxx的开裆裤","ID:Cxx的开裆裤","图片:auto"],
			["品质:","数量:123"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["碾压王","ID:drinkCanMegaCrush","图片:auto"],
			["品质:auto","数量:999"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["祖父的私酒","ID:drinkJarGrandpasMoonshine","图片:auto"],
			["品质:auto","数量:1234"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["auto","ID:积分满减券100-50","图片:auto"],
			["品质:auto","数量:3"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["auto","ID:积分满减券50-10","图片:auto"],
			["品质:auto","数量:5"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["auto","ID:积分折扣券100-9.5","图片:auto"],
			["品质:auto","数量:1"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["auto","ID:钻石满减券50-5","图片:auto"],
			["品质:auto","数量:2"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["auto","ID:补签卡","图片:auto"],
			["品质:auto","数量:5"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["auto","ID:test5","图片:auto"],
			["品质:auto","数量:5"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
		],
		
		[["玩家2","76561199000000002"],
		
			[["南瓜灯","ID:decoPumpkinJackOLantern","图片:auto"],
			["品质:auto","数量:10"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["Cxx的尿不湿","ID:Cxx的尿不湿","图片:auto"],
			["品质:auto","数量:6"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
		],
		
		[["玩家3","76561199000000003"],
		
			[["南瓜灯","ID:decoPumpkinJackOLantern","图片:auto"],
			["品质:auto","数量:10"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
			
			[["Cxx的尿不湿","ID:Cxx的尿不湿","图片:auto"],
			["品质:auto","数量:6"],
			["总分类:auto","子分类:auto","mod:auto"],["auto"]],
		],
		
		//foot
	];
	//arrwareToObj();	//将仓库数组转换为obj储存格式
	
});