{
  "code": 0,
  "message": "",
  "data": {
    "content_is_contrast": true,
    "abstract_is_contrast": true,
    "title_is_contrast": true,
    "original": {
      "title": "量化大佬再次发声：想要大幅缩表，美联储最多只能加息100个基点",
      "abstract": "法兴银行的量化专家Solomon Tadesse表示，美联储额外的加息空间还有300个基点，最可能的情况是通过缩表1.8万亿美元和额外加息75至100个基点来实现。",
      "content": [
        "<div>",
        "<p>来源：金十数据</p>",
        "</div>",
        "<div>",
        "<p>法兴银行的量化专家Solomon Tadesse表示，美联储额外的加息空间还有300个基点，最可能的情况是通过缩表1.8万亿美元和额外加息75至100个基点来实现。</p>",
        "</div>",
        "<p>市场对美联储加息的预期仍在升温，上周一度有人押注美联储会在5月加息75个基点。<strong>这种疯狂的定价表明，交易员并不相信短期美债的价格下跌已经结束，也不相信市场有足够的加息溢价。</strong></p>\n",
        "<p>然而，很多人怀疑，美国经济能否承受住美联储今年额外250个基点的加息，即将在周四公布的GDP数据可能会显示，美国的经济增长势头在今年前三个月急剧下降。</p>\n",
        "<p><img alt=\"\" src=\"https://postimg.futunn.com//tmp/phpMUxPZL.png/big\"></p>\n",
        "<p>在消费已经被近40年来的最高通胀影响的时候，如果美联储以近几十年来最快的速度收紧货币政策，有可能会完全扼杀经济增长。因此，有人认为，相比于沃尔克时代，如今的美联储可能难以忍受紧缩政策对股市的伤害。</p>\n",
        "<p>过去两个月里，法国兴业银行的量化专家Solomon Tadesse曾多次表示，如果考虑到加息和缩表的累计效果，美联储最终不太可能达成市场定价的直接加息次数。该行的另一位专家Albert Edwards也曾表示，美联储可能不会将利率升至1%以上。</p>\n",
        "<p>在最新的报告中，Tadesse更新了他的分析称：</p>\n",
        "<blockquote><p>分析结果暗示，当美联储直接加息75至100个基点并通过缩表1.8万亿美元来达成220个基点的隐性加息之后，美联储的货币政策周期可能会见顶。</p></blockquote>\n",
        "<p>Tadesse通过了紧缩与宽松的比率（MTE）来计算，该比例正随着时间的推移呈下降趋势。低于1则意味着政策趋向宽松。</p>\n",
        "<p>考虑到货币政策的结构性转变，评估当前状态的最佳参考是自1980年代中期以来后通胀时代的经验。这个时期的MTE相对稳定，从1989-2000年周期的52%升至2000-2007年周期的77%，平均MTE为69%。</p>\n",
        "<p>此前货币宽松阶段的货币宽松总程度（包括由疫情引发的大量流动性注入）达到了7.9%，因此，为了在这个紧缩周期中达到过去四个周期的平均MTE比率，美联储的收紧程度需要从上一个谷底收紧约542个基点（69%*7.9%）。</p>\n",
        "<p><img alt=\"\" src=\"https://postimg.futunn.com//tmp/php2f8Z4z.png/big\"></p>\n",
        "<p>与此同时，Tadesse提醒称，目前美联储的影子利率已经从周期低点大幅收紧：</p>\n",
        "<blockquote><p>利率上升了250个基点，反映了市场对美联储缩表和加息的预期。</p></blockquote>\n",
        "<p>考虑到这一点之后，美联储还需额外紧缩约300个基点（2.92%），以达到在1980年代之后的后滞胀时代观察到的利率周期的平均峰值。</p>\n",
        "<p>当然，<strong>紧缩的300个基点并非完全来自直接加息，有很多种加息和缩表的组合可以达到累计300个基点的紧缩。</strong>如下图所示的模型一样，红线（货币政策边界，Monetary Policy Frontier，MPF）代表累计300个基点的紧缩。</p>\n",
        "<p><img alt=\"\" src=\"https://postimg.futunn.com//tmp/php9HIe4s.png/big\"></p>\n",
        "<p>也就是说，如果美联储打算大幅缩减资产负债表，加息的空间就会严重受限。而如果美联储如市场预期一样在今年额外加息250个基点，同时还大幅缩表，那么最终的紧缩程度将远超过此前周期的紧缩程度，即在上图的灰色区域。</p>\n",
        "<p>问题是，美联储有可能就打算如市场预期那样加息，因为美联储很想挽回已经支离破碎的公信力。但Tadesse表示：</p>\n",
        "<blockquote><p>基于历史数据的分析表明，任何将整体货币政策立场推到MPF之外的政策组合，都有可能引发经济硬着陆，引起严重的市场反应和经济衰退。</p></blockquote>\n",
        "<p>Tadesse认为，<strong>额外的75至100个基点的加息与大约1.8万亿美元的QT结合一起的政策路径（即上图绿星位置）更有可能。</strong></p>\n",
        "<p>如果Tadesse的分析是正确的，并假设美联储将缩表近2万亿美元，那么加息1次75个基点或者加息两次50个基点的举动，将耗尽美联储在加息方面的政策空间。</p>\n",
        "<div>",
        "<p>编辑/Corrine</p>",
        "</div>"
      ]
    },
    "trans": {
      "title": "The boss of quantification once again spoke out: if the Fed wants to shrink the table sharply, the Fed can only raise interest rates by 100 basis points at most.",
      "abstract": "Solomon Tadesse, a quantifier at Soci é t é G é n é rale, said the Fed had 300bp more room to raise interest rates, most likely by shrinking the table by $1.8 trillion and raising interest rates by an additional 75 to 100bp.",
      "content": [
        null,
        "<p>Source: Jinshi data</p>",
        null,
        null,
        "<p>Solomon Tadesse, a quantifier at Soci é t é G é n é rale, said the Fed had 300bp more room to raise interest rates, most likely by shrinking the table by $1.8 trillion and raising interest rates by an additional 75 to 100bp.</p>",
        null,
        "<p>Expectations of a Fed rate hike are still rising, with at one point last week there were bets that the Fed would raise interest rates by 75 basis points in May.<strong>This frenzied pricing suggests that traders do not believe that the fall in the price of short-term Treasuries is over, nor do they believe that there is enough interest rate premium in the market.</strong></p>\n",
        "<p>However, many doubt whether the US economy will be able to withstand the Fed's additional 250bp rate hike this year, and GDP data to be released on Thursday are likely to show a sharp decline in US economic growth in the first three months of the year.</p>\n",
        null,
        "<p>At a time when consumption has been affected by the highest inflation in nearly 40 years, if the Fed tightens monetary policy at its fastest pace in recent decades, it could completely stifle economic growth. As a result, some people think that compared with the Volcker era, the Fed may not be able to bear the harm of tightening policy to the stock market.</p>\n",
        "<p>Solomon Tadesse, a quantifier at Soci é t é G é n é rale, has repeatedly said in the past two months that the Fed is unlikely to end up with market-priced direct rate increases if the cumulative effects of interest rate hikes and shrinking tables are taken into account. Albert Edwards, another expert at the bank, has also said that the Fed may not raise interest rates above 1 per cent.</p>\n",
        "<p>In the latest report, Tadesse updated his analysis saying:</p>\n",
        "<blockquote><p>The results suggest that the Fed's monetary policy cycle may peak when it directly raises interest rates by 75 to 100bp and achieves a 220bp implicit rate hike by shrinking the table by $1.8 trillion.</p></blockquote>\n",
        "<p>Tadesse calculates the ratio of tightening to easing (MTE), which is declining over time. Less than 1 means that policy tends to be loose.</p>\n",
        "<p>Given the structural shift in monetary policy, the best reference for assessing the current state is the experience of the post-inflationary era since the mid-1980s. During this period, MTE was relatively stable, rising from 52 per cent of the 1989-2000 cycle to 77 per cent of the 2000-2007 cycle, with an average MTE of 69 per cent.</p>\n",
        "<p>The overall level of monetary easing in the previous phase of monetary easing (including massive liquidity injections triggered by the epidemic) reached 7.9 per cent, so in order to reach the average MTE ratio of the past four cycles in this tightening cycle, the Fed needs to tighten by about 542bp (69 per cent to 7.9 per cent) from the previous trough.</p>\n",
        null,
        "<p>Meanwhile, Tadesse cautioned that the Fed's shadow interest rates have tightened sharply from cyclical lows:</p>\n",
        "<blockquote><p>Interest rates rose 250 basis points, reflecting market expectations of the Fed's shrinking schedule and raising interest rates.</p></blockquote>\n",
        "<p>With this in mind, the Fed needs to tighten by about 300 basis points (2.92 per cent) to reach the average peak of the interest rate cycle observed in the post-stagflation era after the 1980s.</p>\n",
        "<p>That's for sure,<strong>The 300 basis points of tightening does not come entirely from direct interest rate hikes. There are many combinations of interest rate hikes and shrinking tables that can achieve a cumulative contraction of 300 basis points.</strong>Like the model shown in the chart below, the red line (monetary policy boundary, Monetary Policy Frontier,MPF) represents a cumulative tightening of 300bp.</p>\n",
        null,
        "<p>In other words, if the Fed were to shrink its balance sheet sharply, the room to raise interest rates would be severely limited. And if the Fed raises interest rates by an extra 250 basis points this year, as expected, while shrinking its chart sharply, the ultimate tightening will be far greater than in previous cycles, in the gray area above.</p>\n",
        "<p>The problem is that the Fed is likely to raise interest rates as the market expects, because the Fed is keen to restore its fragmented credibility. But Tadesse said:</p>\n",
        "<blockquote><p>Analysis based on historical data shows that any policy combination that pushes the overall monetary policy stance outside the MPF is likely to trigger a hard landing, causing a serious market reaction and recession.</p></blockquote>\n",
        "<p>Tadesse thinks<strong>The policy path of an additional 75 to 100bp rate hike combined with a QT of about $1.8 trillion (the green star position pictured above) is more likely.</strong></p>\n",
        "<p>If Tadesse's analysis is correct and assumes that the Fed will shrink the table by nearly $2,000bn, then raising interest rates by 75 basis points once or 50 basis points twice will deplete the Fed's policy room to raise interest rates.</p>\n",
        null,
        "<p>Edit / Corrine</p>",
        null
      ]
    }
  }
}
